tap "cj-systems/gitflow-cjs"
tap "ddev/ddev"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "shivammathur/php"
brew "openssl@3"
brew "pcre2"
brew "age"
brew "brotli"
brew "autoconf"
brew "bitwarden-cli"
brew "cmake"
brew "dbmate"
brew "deno"
brew "doctl"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnumeric"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "grep"
brew "gum"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "libffi"
brew "lnav"
brew "mkcert"
brew "ncdu"
brew "neovim"
brew "nikto"
brew "oha"
brew "pipx"
brew "pkg-config"
brew "plow"
brew "python@3.10"
brew "qcachegrind"
brew "ruby"
brew "sshs"
brew "starship"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "vivid"
brew "volta"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh-autocomplete"
brew "cj-systems/gitflow-cjs/git-flow-cjs"
brew "ddev/ddev/ddev"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "mongodb/brew/mongodb-database-tools"
cask "aerospace"
cask "alacritty"
cask "appcleaner"
cask "arc"
cask "clickup"
cask "discord"
cask "docker"
cask "duckduckgo"
cask "eqmac"
cask "firefox"
cask "font-cascadia-code-nf"
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hiddenbar"
cask "httpie"
cask "imageoptim"
cask "macmediakeyforwarder"
cask "microsoft-edge"
cask "mongodb-compass"
cask "mos"
cask "ngrok"
cask "nucleo"
cask "obsidian"
cask "raycast"
cask "slack"
cask "spotify"
cask "syncthing"
cask "tableplus"
cask "upscayl"
cask "visual-studio-code"
cask "vivaldi"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "johnbillion.vscode-wordpress-hooks"
vscode "mblode.twig-language-2"
vscode "mikestead.dotenv"
vscode "mousavian.ssh-config-syntax-highlighter"
vscode "mquandalle.graphql"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "pflannery.vscode-versionlens"
vscode "sissel.shopify-liquid"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "tommasov.hosts"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
vscode "zepich.twig-braces-helper"
